{"body":"\n## What is a Code Reading Club?\n\nIt's an experiment!\n\nAt its core is the idea that the paradigm we use to teach programming is flawed. One of the most obvious omissions is the ability to read code, both phonetically and analytically. Read [Felienne's blog post](https://www.felienne.com/archives/6472) for more information about the theory behind it.\n\nAs professional developers who read code every day, we aren't suitably equipping ourselves with these building blocks.\n\nSo Felienne developed some exercises for [Katja](https://github.com/katjam) to try with [Neontribe](https://neontribe.co.uk), based on her research and teaching exercises she uses with students.\n\nWe tried them, we loved them, we shared them with other developers\n\n...and now we are practicing with and iterating on those exercises.\n\n\n## How do I get started?\n\n### Join us for a public club! Free. Online. International.\nWant to start a club, but not sure how it works? Don't have enough people in your workplace to join you? We sometimes run sessions about how to start a club or invite new people to join our public clubs. We currently hold an open public club on the first Tuesday of every month.\n\n- Our next session is on 7 September 2021 from 19:00 to 20:30 (CET).\n\n#### Interested? [Get in touch](mailto:hello@code-reading.org) or [Join our mailing list](http://eepurl.com/hzYTQv)\n\nYou can find the [exercises](https://github.com/CodeReadingClubs/Resources/blob/trunk/exercises.md) in our resources github repo.\n\nYou can use our [pdf from github code tool](https://pdf-maker.netlify.app/) to download a pdf for your club.\n\nYou can run your club in whatever way you want, but we recommend to meet for 1 hour 15 mins every other week.\n\n## Who can participate?\n\nParticipants should have had some exposure to code, but your group might include programming adjacent people like testers or scrum masters, we have seen examples where those people also got value out of the club. We have seen it work for groups diverse in other ways too (in terms of cognitive, formal training, experience, skills, style etc).\n\n## What code should I use?\n\nWe have seen different types of clubs: you might be interested in code form your own code base, maybe in one language, or select open source code in a variety of languages. In our experience, it does not matter all that much what code you pick. The key benefit is an increased ability to understand code when reading and a more sympathetic style of writing code to be read by others, which we think you get more from the process than form the code. Some people though join a club to also learn a new language as a byproduct. When you have a few of those in your group, you might want to stick to one language.\n\n## We're still working on it\n\n...so the [starter kits](https://github.com/CodeReadingClubs/Resources/tree/trunk/StarterKit) are a little rough around the edges!\n\n## Get in touch!\n\nIf you decide to start a club, please get in touch. We'd love to hear about it, or even sit in on a session with you. Please contact [hello@code-reading.org](mailto:hello@code-reading.org) if you want to get involved, or have any suggestions.\n\nThe initial inspiration for the clubs was [How to teach programming (and other things)?](https://www.youtube.com/watch?v=g1ib43q3uXQ) by [Felienne Hermans](https://www.felienne.com/).\n\nWe're also really excited about Felienne's new book: [The Programmer's Brain](https://www.manning.com/books/the-programmers-brain) which can be pre-ordered now!\n","staticData":{}}