{"body":"\n# Code of Conduct\n\nWe've found that code reading clubs work best when you involve people with different backgrounds and levels of experience. People read code differently and we can learn a lot from each other. It's important for us to make sure the environment where these discussions happen is inclusive and supportive. Everyone should feel comfortable to participate! The following guidelines are meant to codify these intentions.\n\n## How to be with each other\n\nWe expect ourselves and participants to ensure that our community is harrassment-free for everyone.\n\n### Examples of behaviours that help us to provide an an open, welcoming, diverse, inclusive, and healthy community:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologising to those affected by our mistakes\n* Learning from our and others' mistakes and not repeating negative behaviour\n* Focusing on what is best for the overall community, not just ourselves as individuals\n* When discussing code, avoid criticising the person who wrote the code\n* Remembering we don't know the context or reasons for decisions made by others\n\n\n### Examples of unacceptable behavior include:\n\n* Public or private harassment of any kind including offensive comments related to gender, sexual orientation, disability, physical appearance, body size, race, politics, or religion\n* The use of sexualised language or imagery, and sexual attention or advances of any kind\n* Sharing others' private information, such as a physical or email address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a professional setting\n\n\n## Guidelines for running a club\n\nThe code of conduct above is the one we use in our clubs. Feel free to use it as is or modify it to fit your circumstances.\n\nAs a facilitator it's important that you not only follow your code of conduct, but also enforce it. Your code of conduct should be made available to attendees before the club and you should ask them to read it before attending. It's good practice to quickly go over the guidelines at the beginning of the session. Make sure to give attendees a way to inform you of any code of conduct violations they experience.\n\n## Talk to us\n\n### hello@codereading.club\n\nIf you experience any behaviours or atmosphere in our groups that feels contrary to these values, please let us know. We want everyone to feel safe, equal and welcome.\n\nIf you have any questions, concerns or suggestions regarding this policy, please get in touch.\n","staticData":{}}